Revit 2027 API
StairsRunType.TotalDepth Property
 The total depth of the stairs run, only available for monolithic stairs run.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double TotalDepth { get; }
Public ReadOnly Property TotalDepth As Double
	Get
public:
property double TotalDepth {
	double get ();
}
member TotalDepth : float with get
Property Value
Double
See Also
Reference
StairsRunType Class
Autodesk.Revit.DB.Architecture Namespace